{
    "Skibidi": "A reference to the 'Skibidi Toilet' meme, representing absurdity and humor.",
    "Rizz": "Slang for having charm or charisma, especially in a dating context",
    "Fanum Tax": "The concept of sharing or 'taxing' friends by asking for a portion of their belongings.",
    "Sigma": "Refers to a person, often male, who is a 'lone wolf' with strong individualistic qualities.",
    "NPC": "Means 'non-playable character,' implying someone is acting robotic or mindlessly.",
    "Cap": "Used to call out lies or exaggerations; if something is true, it’s 'no cap.'",
    "Gyatt": "An expression of surprise or admiration, often over someone’s looks.",
    "Ratioed": "Occurs when a reply or comment gets more likes than the original post, implying disagreement.",
    "POV": "Stands for 'point of view,' a trend where videos depict situations from a particular angle.",
    "Sus": "Short for 'suspicious,' often with playful undertones.",
    "Finsta": "Fake Instagram account used for close friends, not for public viewing.",
    "FYP": "TikTok’s 'For You Page,' where users find personalized content.",
    "Simp": "Refers to someone who shows excessive affection for someone they admire.",
    "Stan": "A combination of 'stalker' and 'fan,' meaning a dedicated supporter.",
    "Yeet": "A word that signifies throwing or excitement, often dramatically.",
    "Bussin": "Used to describe something particularly good or delicious.",
    "Flex": "Showing off, usually humorously or ironically.",
    "Thirst Trap": "A photo or video intended to attract attention or admiration.",
    "Ghosting": "The act of suddenly cutting off communication without explanation.",
    "Clout": "Refers to influence or fame, often linked with social media success.",
    "Glow-Up": "Describes a transformation, typically a positive physical change.",
    "Cancel": "To dismiss or call out something or someone in a funny way.",
    "Tea": "Refers to gossip or juicy information.",
    "Low-Key": "Doing something subtly or in a downplayed manner.",
    "High-Key": "The opposite of low-key, meaning obvious or open about something.",
    "Savage": "Someone who makes unapologetic, bold moves or remarks.",
    "Ship": "Short for 'relationship,' used when hoping two people will get together.",
    "Triggered": "Reacting strongly to something, often as a joke.",
    "Main Character": "Describes someone who acts as though they’re the hero of their own story.",
    "AFK": "Away from keyboard; describes a player not actively participating.",
    "Respawn": "To re-enter a game after dying or being eliminated",
    "Clutch": "When a player achieves something impressive under pressure.",
    "OP": "Stands for 'overpowered,' usually describing a strong character or tool.",
    "Easter Egg": "Hidden features or jokes within a game or piece of media.",
    "Noob": "Refers to someone inexperienced or bad at a game.",
    "1v1": "A challenge to a duel, especially in competitive games.",
    "GG": "Good game; typically said after completing a match.",
    "Meta": "Refers to the most effective strategies currently in use in a game.",
    "Lag": "Slow internet response time that disrupts gameplay.",
    "Toxic": "Describes players who engage in negative or insulting behavior.",
    "Grind": "Constantly playing or working hard to level up or improve.",
    "Sweat": "A player who takes the game extremely seriously, often to the point of annoyance.",
    "Camp": "Staying in one place to ambush other players.",
    "Rage Quit": "Exiting a game abruptly due to frustration.",
    "Emote": "In-game expressions, often animated, to convey emotions.",
    "Boss Fight": "The final or most difficult level in a game.",
    "Nerf": "To weaken or downgrade a character or weapon in a game.",
    "Hitbox": "The invisible shape that determines if an object in the game takes damage.",
    "Wallhack": "A cheat allowing players to see through walls.",
    "Spawn Kill": "Eliminating players immediately after they respawn.",
    "Third-Person": "A game perspective where players view their character from behind.",
    "Sandbox": "A game that offers open-ended, creative gameplay.",
    "Open World": "Games with vast, explorable landscapes.",
    "PvP": "Player versus player, often competitive modes.",
    "PvE": "Player versus environment, focusing on solo or cooperative play against AI.",
    "Stealth": "Gameplay that emphasizes avoiding detection.",
    "Crafting": "Creating or customizing in-game items.",
    "Speedrun": "Completing a game as fast as possible, often competitively",
    "Vibe Check": "A phrase to assess someone’s mood or attitude.",
    "Alt": "Refers to an 'alternative' style, often edgy or different from mainstream culture.",
    "Soft": "Aesthetic term for someone who’s gentle, pastel-themed, or delicate.",
    "Edgy": "Describes a style or attitude meant to be intense, dark, or unconventional.",
    "Main Character Energy": "Refers to someone who seems confident, like the star of a story.",
    "Introvert": "Someone who finds social interaction draining and prefers alone time.",
    "Extrovert": "Someone energized by social interaction and being around others.",
    "Ambivert": "A blend of introvert and extrovert qualities.",
    "Aesthetic": "A visual or stylistic vibe, often linked to personal branding on social media.",
    "E-Girl": "A style associated with internet culture, heavy makeup, and gaming aesthetics.",
    "E-Boy": "The male counterpart to the E-Girl, typically with an emo or edgy look.",
    "Cottagecore": "A nostalgic aesthetic inspired by countryside, simplicity, and nature.",
    "VSCO Girl": "A style known for scrunchies, Hydro Flasks, and an eco-friendly vibe.",
    "Pick-Me Girl": "Someone who seeks male approval by putting down other girls.",
    "Crunchy": "Describes a natural, eco-conscious, and often minimalistic lifestyle.",
    "Glow-Down": "Opposite of a glow-up, when someone’s appearance has worsened.",
    "Wholesome": "Content or people who are positive, kind, and heartwarming.",
    "Sadboi": "A male who embraces sadness as part of his identity or aesthetic.",
    "Big Mood": "Expressing strong relatability or connection to an experience.",
    "Sassy": "Used to describe someone who’s outspoken, bold, and a bit cheeky.",
    "Chill": "Someone or something relaxed, easygoing, and unbothered.",
    "Bougie": "Refers to something luxurious or high-end, sometimes mockingly.",
    "Meme Lord": "A person highly knowledgeable and engaged in meme culture.",
    "Ratchet": "A term for behavior or style seen as unrefined or exaggerated.",
    "DIY Queen/King": "Someone known for their love of crafting and do-it-yourself projects.",
    "Queen Energy": "Refers to someone acting with confidence, usually in a supportive sense.",
    "Cultural Reset": "A moment, event, or trend that changes the cultural landscape.",
    "Himbo": "A friendly, muscular, not-so-bright male archetype.",
    "Iconic": "Describes something or someone that stands out, memorable or trendsetting.",
    "Old Soul": "Someone who is young but has a mature, timeless perspective.",
    "Mood": "A way to express relatability, often with humorous undertones.",
    "Dead": "Used when something is so funny or shocking that it 'kills' you with laughter.",
    "Cracked": "Means someone is exceptionally good at something, often in gaming.",
    "Vibing": "Being completely absorbed in a relaxed, enjoyable mood.",
    "Salty": "Feeling annoyed, frustrated, or bitter, usually over something minor.",
    "YOLO": "'You Only Live Once,' used to justify reckless behavior.",
    "Swole": "Muscular or well-built; often used humorously.",
    "L": "Short for 'loss,' used to indicate failure or defeat.",
    "W": "Short for 'win,' often to cheer someone on.",
    "Based": "A compliment for someone unafraid to speak their truth.",
    "Cringe": "When something or someone is awkward or embarrassing.",
    "Edgelord": "Someone who acts deliberately provocative to get a reaction.",
    "F": "Used to pay respects, adapted from video game culture.",
    "Oof": "A reaction to misfortune or something mildly upsetting.",
    "Extra": "Over-the-top behavior, usually in an amusing way.",
    "Pop Off": "To do something exceptionally well or energetically.",
    "Bomb": "When something is amazing, or someone does exceptionally well.",
    "Woke": "Originally meaning socially aware, now often used humorously.",
    "Dab": "A celebratory gesture, often done as a joke.",
    "SMH": "'Shaking my head,' usually to convey mild disapproval or disbelief.",
    "Legit": "Genuine or real, often used for emphasis.",
    "Big Brain": "Used to praise someone for being clever or making a smart move.",
    "No Chill": "When someone is overreacting or too intense.",
    "Ew": "A simple reaction to something unpleasant or gross.",
    "Relatable": "When something feels like it directly applies to your life.",
    "Drip": "Refers to an impressive sense of style or outfit.",
    "Fit": "Short for 'outfit,' often used to praise someone’s clothing.",
    "Y2K": "A nostalgic style inspired by the early 2000s.",
    "Core": "A suffix added to define a specific aesthetic, like 'cottagecore' or 'normcore.'",
    "Streetwear": "Casual, urban style often associated with brands like Supreme or Off-White.",
    "Gothcore": "An aesthetic inspired by gothic fashion and dark themes.",
    "Baddie": "Refers to someone with a confident, trendy, and often Instagram-ready style.",
    "Preppy": "Style that’s polished and associated with upscale or Ivy League-inspired fashion.",
    "Layering": "Styling technique that involves wearing multiple clothing layers for effect.",
    "Statement Piece": "A bold or standout item in an outfit.",
    "Oversized": "Loose, baggy clothing that’s both comfortable and fashionable.",
    "Throwback": "Refers to retro styles from past decades, brought back into fashion.",
    "High-Fashion": "Clothing or style associated with luxury brands and high-end designers.",
    "Sneakerhead": "A person who collects, trades, or is obsessed with sneakers.",
    "Vintage": "Clothing from past eras, particularly those associated with quality or uniqueness.",
    "Fast Fashion": "Cheap, trend-driven clothing that’s mass-produced.",
    "Minimalist": "Style focused on simplicity and neutral tones, avoiding clutter.",
    "Eco-Friendly": "Fashion that prioritizes sustainable and environmentally conscious practices.",
    "Athleisure": "Clothing designed for athletic activities but worn casually.",
    "Normcore": "A style that embraces unassuming, everyday clothing.",
    "Avant-Garde": "Bold, experimental, and artistic style choices.",
    "Grunge": "Style inspired by 1990s punk and alternative scenes.",
    "Color Blocking": "Wearing blocks of solid, contrasting colors in an outfit.",
    "Haul": "A shopping spree or collection of items, often shared online.",
    "Thrifted": "Clothes purchased secondhand, often at a thrift store.",
    "Elevated Basics": "Simple pieces styled in a way that makes them look high-end.",
    "Retro": "Refers to styles inspired by past decades, like the 70s or 80s.",
    "Eco Chic": "Fashion that combines trendy style with eco-friendly practices.",
    "Fast-Fashion Haul": "A large collection of affordable, trendy clothing, usually from fast-fashion stores.",
    "Lookbook": "A collection of styled outfits, often presented for inspiration",
    "Mukbang": "A trend where people film themselves eating large quantities of food.",
    "Satisfying": "Used to describe content, often food, that’s visually pleasing.",
    "Cheat Day": "A day when someone indulges in foods outside of their usual diet.",
    "Plant-Based": "A diet that focuses on food from plants rather than animals.",
    "Charcuterie": "An arrangement of meats, cheeses, fruits, and more, often shared on social media.",
    "Foodie": "A person passionate about food, often sharing their finds online.",
    "Food Porn": "Highly appealing images of food, often indulgent or aesthetically pleasing.",
    "Superfood": "Foods rich in nutrients, like acai, chia seeds, and kale.",
    "Clean Eating": "A focus on whole foods and avoiding processed items.",
    "Insta-Worthy": "Food that’s visually stunning and ready for social media.",
    "Savory": "Used to describe flavors that aren’t sweet but still delicious.",
    "Picky Eater": "Someone who avoids a lot of foods or is selective about what they eat.",
    "Keto": "A low-carb, high-fat diet popular in online communities.",
    "Gluten-Free": "Diet excluding gluten, often for health or dietary restrictions.",
    "Chaffles": "A keto-friendly waffle made from cheese and eggs.",
    "Bulletproof Coffee": "Coffee mixed with butter, popular with keto enthusiasts.",
    "Vegan Cheese": "Cheese made from plant-based sources.",
    "Smoothie Bowl": "A thick smoothie served in a bowl, usually with toppings.",
    "Fermented": "Foods that have been preserved using bacteria, like kimchi or kombucha.",
    "Whole30": "A 30-day diet focusing on whole foods and eliminating certain groups.",
    "Fusion": "Combining elements from different culinary traditions in one dish.",
    "Edible Art": "Food made to be visually artistic, popular in social media posts.",
    "Comfort Food": "Foods that are nostalgic and satisfying.",
    "Mocktail": "A non-alcoholic drink made to resemble a cocktail.",
    "Soul Food": "Traditional African-American cuisine, especially popular in the Southern U.S.",
    "Sourdough": "A type of bread that became a huge trend during the pandemic.",
    "Ice Cream Roll": "Rolled ice cream trend that went viral for its unique presentation.",
    "Deconstructed": "Presenting food elements separately rather than mixed.",
    "Golden Milk": "A drink made with turmeric and milk, often for its health benefits.",
    "Viral Recipe": "Recipes that gain massive popularity online, like dalgona coffee.",
    "Memes": "Digital images, videos, or texts created for humor and shared online.",
    "Backup": "Copying files to another location to prevent data loss.",
    "Screen Time": "Time spent on digital devices, often monitored for balance.",
    "Face Filter": "Digital effects on camera apps to alter appearances.",
    "Livestream": "Broadcasting video in real-time, often to interact with viewers.",
    "Deepfake": "A manipulated video or image that replaces one person’s face with another.",
    "Mindfulness": "Staying aware of the present moment, often practiced through meditation.",
    "Pilates": "A form of exercise focused on core strength, popular in online fitness.",
    "Green Smoothie": "A smoothie made primarily with green vegetables, praised for health.",
    "Intermittent Fasting": "Eating pattern involving periods of fasting and eating windows.",
    "Cleanse": "A short-term diet to 'clean' the body, often with juices.",
    "Yoga Flow": "A sequence of yoga poses, often shared as workout content.",
    "Self-Love": "Emphasis on accepting and valuing oneself, often discussed in wellness.",
    "Fitness Challenge": "Programs designed to encourage exercise consistency, often online.",
    "Spa Day": "A day focused on self-care activities like facials or relaxation.",
    "Breathwork": "Techniques for conscious breathing to support relaxation and focus.",
    "Supplements": "Vitamins or minerals taken to improve diet and health.",
    "HIIT": "High-Intensity Interval Training, a workout style involving quick bursts.",
    "Low-Impact": "Exercises that reduce stress on joints, like walking or cycling.",
    "Mental Health Day": "Taking a day off for mental recovery.",
    "Acai Bowl": "A smoothie bowl made with acai berries, popular for health benefits.",
    "Grounding": "Practice of connecting with nature, often by walking barefoot.",
    "Aromatherapy": "Using essential oils for therapeutic benefits.",
    "Gut Health": "Focus on dietary choices that support digestion and microbiome.",
    "Kombucha": "A fermented tea believed to have health benefits.",
    "Sleep Tracker": "Device or app that monitors sleep patterns.",
    "Cold Plunge": "Exposure to cold water for supposed health benefits.",
    "Balanced Diet": "Eating various foods to maintain health.",
    "Body Positivity": "Movement promoting acceptance of all body types.",
    "Detox Water": "Water infused with fruit or herbs, believed to cleanse the body.",
    "Infrared Sauna": "Sauna experience using infrared light for deep heating.",
    "Recovery": "Restorative practices post-workout, like stretching or foam rolling.",
    "Hydration Reminder": "Apps or alarms prompting people to drink water regularly.",
    "Healthy Swap": "Replacing less nutritious food with healthier options.",
    "Functional Fitness": "Exercises designed to improve real-life movement and strength.",
    "goofy ahh": "silly",
    "ayo": "to express shocking to a sentence that sounded strange and often ",
    "based": "efers to something or someone as one that you agree with. but it can be used ironically or sarcastically",
    "blud":"used as a synonym of “bro”.",
    "bombaclat":"frequently used as an interjection to convey disgust or shock.",
    "before GTA 6":"used at the end sentence, to tell a thing happend before quarter of 2025",
    "+100 aura point": "to compliment",
    "backroom": "yellow office maze",
    "chat is this real?":"to ask people, is it real or fake",
    "just put the fries in the bag":"The phrase “put the fries in the bag” is a slang term used to insult someone or make them feel less important, especially when you disagree with their opinions or ideas.",
    "cook":"To cook means to do something they are good at",
    "cooked":"doomed",
    "cringe":"Any action, behaviour or object that gives you second-hand embarrassment",
    "delulu":"delusion",
    "crashout":"he term “crash out” refers to someone who takes big risks with their life and future, acting like they don’t care about what might happen next. It’s like they believe they have nothing to lose. So, when we say someone is “crashing out,” we mean they are behaving in a really reckless way.",
    "Duke Dennis":"a Twitch streamer and youtuber",
    "nice try Diddy":"P. Diddy trying to be involved in everything.",
    "edging":"Edging is about getting really close to climax during sex or masturbation, then pausing before you finish. You can do it alone or with someone else.",
    "English or Spanish?":"which you ask the phrase to someone and if they choose any of the two languages, you tell them the following in the chosen language: The first person to move is ‘gay’",
    "Erm, what the sigma":"A line that was originally a voice message, of who is imitating Squidward Tentacles, in which the voiceline audibly says “Erm, what the sigma?” ",
    "FE!N":"“FE!N” is the title of a song by Travis Scott featuring Playboi Carti. The title originates from the word “fiend”.",
    "gooning":"“Gooning” is a state a man typically reaches after a long edging session, where he becomes captivated by the sensations coming from his penis.",
    "glazing":"means overly praising somebody, commonly a celebrity.",
    "Grimace Shake":"An exclusive milkshake from McDonald’s to celebrate Grimace’s birthday. It has been used as a meme with people dying or going insane after trying the grimace shake.",
    "Hawk Tuah":"Coined by Haliey Welch during an on-the-spot street interview published by Youtuber Duo on June 23, 2024, “Hawk Tuah” is an onomatopoeia for spitting on a man’s penis before oral sex.",
    "hear me out":"Said before referencing something or someone not conventionally attractive–usually a fictional character, connotation to refer to any crazy idea",
    "Kai Cenat":"A twitch streamer",
    "ligma":"Ligma” is a fictional disease. The word “Ligma” is often followed by the word “Balls” (“Ligma Balls” = “Lick my balls”)",
    "Looksmaxxing":"Looksmaxxing is a term for improving your looks overtime, with practices such as mewing.",
    "mewing":"Mewing is an exercise done to improve your jawline. In TikTok culture it is used to refer to ‘Alpha’ males and their ‘perfect’ body, which includes their jawline, which is stereotypically well-defined.",
    "lunchly":"A food product & Lunchables competitor created by KSI, Logan Paul, & Mrbeast.",
    "Mah boi":"Another quote originating from the Zoomer Generation. It’s the line immediately following ‘Gee, it sure is boring around here’ in “Link: Forces of Evil”.Widely remembered as one of the most iconic lines from the Phillip’s CD-i Nintendo games and Youtube Poop era, and is one of the few still commonly referenced.",
    "Macth my freak":"A verse from Tinashe – Nasty. Refers to seeking someone with a similar sexual deviancy, as well as mocking the related Tik Tok trend.",
    "mid":"To call something mediocre. Usually used derogatively to refer to a highly praised item or public figure.",
    "mogging":"eans being more good-looking than other people, and it’s part of a trend called “looksmaxing”, which is all about making yourself look better.",
    "Ohio":"A U.S. state on the northeastern edge of the Midwest region, Ohio has been the subject of many memes posted on social media, often captioned with “Only in Ohio” or “[Subject] in Ohio”, as it is portrayed as a “weird state”.",
    "pookie":"Basically your bestie (or best friend). Someone you really love, usually romantically, but can be used platonically.",
    "rev up those fryers":"Used in a dramatic entrance, or when talking to a food server.",
    "slay":"Slay” is a term originally used when someone does something really great and exceed people’s expectation",
    "UwU":"An emoticon representing a cat face, used as an expression of happiness, warmth, or intrigue",
    "Womp Womp":"“Womp Womp” relates to a term of a joke that has fallen flat. This was first known in the late 1800s or early 1900s. It’s commonly used in comics and advertising to denote humor on failure",
    "little bro":"little brother",
    "Yap":"To “yap” or “yapping” means to talk a lot. Especially talking about things that are not really important in the conversation."
}